import itertools
import pandas as pd
import datetime
from datetime import datetime


def append(df):
    pass
if __name__ == "__main__":
    # x	
    # in_id
    # product
    # shop
    # order_plan_start
    # work_start
    # work_end_plan
    # work_end_fact
    # zinc
    # rubberizing
    # material
    # order_plan_shipment_from
    # order_plan_shipment_before
    # order_finish
    from writeplan import dates_to_header
    df = pd.DataFrame({
        # 'x':[140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151],
        'in_id':[1285, 1285, 1285, 1285, 1285, 1285, 1286, 1286, 1286, 1286, 1286, 1286],
        'product':['СМВУА.73.06.К45.В12', '№Зк: 2311879, №СЗ: 369, Кол-во: 1.0', 'Заказчик: ФГ "ХЛІБ-АГРО"', 'Отгрузка: 12.02.2020-19.02.2020 (3-10дн.)', 'КВ: 02.12.2019 (Получено на -2дн. позже)', 'ОС: 02.12.2019 (Получено на -9дн. позже)', 'СМВУ.55.08.К45.В12.А', '№Зк: 2311880, №СЗ: 369, Кол-во: 1.0', 'Заказчик: ФГ "ХЛІБ-АГРО"', 'Отгрузка: 12.02.2020-19.02.2020 (3-10дн.)', 'КВ: 02.12.2019 (Получено на -8дн. позже)', 'ОС: 02.12.2019 (Получено на -10дн. позже)'],
        'shop':['Ц', 'М', 'К', 'З', 'КВ', 'ОС', 'Ц', 'М', 'К', 'З', 'КВ', 'ОС'],
        'order_plan_start':['2019-11-12 00:00:00', '2019-11-12 00:00:00', '2019-11-12 00:00:00', '2019-11-12 00:00:00', '2019-11-12 00:00:00', '2019-11-12 00:00:00', '2019-11-12 00:00:00', '2019-11-12 00:00:00', '2019-11-12 00:00:00', '2019-11-12 00:00:00', '2019-11-12 00:00:00', '2019-11-12 00:00:00'],
        'work_start':['2019-12-02 00:00:00', '2019-12-02 00:00:00', '2019-12-09 00:00:00', '2019-12-02 00:00:00', '2019-11-12 00:00:00', '2019-11-12 00:00:00', '2019-12-02 00:00:00', '2019-12-02 00:00:00', '2019-12-09 00:00:00', '2019-12-02 00:00:00', '2019-11-12 00:00:00', '2019-11-12 00:00:00'],
        'work_end_plan':['2020-02-07 00:00:00', '2019-12-13 00:00:00', '2020-02-07 00:00:00', '2019-12-13 00:00:00', '2019-12-02 00:00:00', '2019-12-02 00:00:00', '2020-02-07 00:00:00', '2019-12-13 00:00:00', '2020-02-07 00:00:00', '2019-12-13 00:00:00', '2019-12-02 00:00:00', '2019-12-02 00:00:00'],
        'work_end_fact':['', '', '', '', '2019-12-04 00:00:00', '2019-12-11 00:00:00', '', '', '', '', '2019-12-10 00:00:00', '2019-12-12 00:00:00'],
        'zinc':['', '', '', '', '', '', '', '', '', '', '', ''],
        'rubberizing':['', '', '', '', '', '', '', '', '', '', '', ''],
        'material':['2019-12-27 00:00:00', '2019-12-27 00:00:00', '2019-12-27 00:00:00', '2019-12-27 00:00:00', '2019-12-27 00:00:00', '2019-12-27 00:00:00', '2019-12-27 00:00:00', '2019-12-27 00:00:00', '2019-12-27 00:00:00', '2019-12-27 00:00:00', '2019-12-27 00:00:00', '2019-12-27 00:00:00'],
        'order_plan_shipment_from':['2020-02-12 00:00:00', '2020-02-12 00:00:00', '2020-02-12 00:00:00', '2020-02-12 00:00:00', '2020-02-12 00:00:00', '2020-02-12 00:00:00', '2020-02-12 00:00:00', '2020-02-12 00:00:00', '2020-02-12 00:00:00', '2020-02-12 00:00:00', '2020-02-12 00:00:00', '2020-02-12 00:00:00'],
        'order_plan_shipment_before':['2020-02-19 00:00:00', '2020-02-19 00:00:00', '2020-02-19 00:00:00', '2020-02-19 00:00:00', '2020-02-19 00:00:00', '2020-02-19 00:00:00', '2020-02-19 00:00:00', '2020-02-19 00:00:00', '2020-02-19 00:00:00', '2020-02-19 00:00:00', '2020-02-19 00:00:00', '2020-02-19 00:00:00'],
        'order_finish':['', '', '', '', '', '', '', '', '', '', '', ''],
        })
    df['order_plan_start'] =  pd.to_datetime(df['order_plan_start'], format='%Y-%m-%d %H:%M:%S.%f')
    df['work_start'] =  pd.to_datetime(df['work_start'], format='%Y-%m-%d %H:%M:%S.%f')
    df['work_end_plan'] =  pd.to_datetime(df['work_end_plan'], format='%Y-%m-%d %H:%M:%S.%f')
    df['work_end_fact'] =  pd.to_datetime(df['work_end_fact'], format='%Y-%m-%d %H:%M:%S.%f')
    df['zinc'] =  pd.to_datetime(df['zinc'], format='%Y-%m-%d %H:%M:%S.%f')
    df['rubberizing'] =  pd.to_datetime(df['rubberizing'], format='%Y-%m-%d %H:%M:%S.%f')
    df['material'] =  pd.to_datetime(df['material'], format='%Y-%m-%d %H:%M:%S.%f')
    df['order_plan_shipment_from'] =  pd.to_datetime(df['order_plan_shipment_from'], format='%Y-%m-%d %H:%M:%S.%f')
    df['order_plan_shipment_before'] =  pd.to_datetime(df['order_plan_shipment_before'], format='%Y-%m-%d %H:%M:%S.%f')
    df['order_finish'] =  pd.to_datetime(df['order_finish'], format='%Y-%m-%d %H:%M:%S.%f')
    df = dates_to_header(df)
    print(df)
    df.to_excel('testfiles\\AppendData.xlsx')